# Incomplete data

In [15]:
import pandas as pd
import numpy as np
# create dummy data
stuff = {'A':[1,2,3], 'B':[4,np.nan,6], 'C':[7,8,9], 'D':[10,11,12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [5]:
# drop rows with null data
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [ ]:
# drop column with null data
my_df.dropna(axis=1)
# use inplace = true to make it permanent

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [13]:
# more thatn one? Set Threshold
my_df.dropna(thresh=2, axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [16]:
# replace thing with fillna()
my_df.fillna(value="Bob")

   A    B  C   D
0  1  4.0  7  10
1  2  Bob  8  11
2  3  6.0  9  12

In [17]:
# use math functions like filling the missing data with the average of the column
my_df.fillna(value = my_df['B'].mean())

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [ ]:
# use min or max or sum
my_df.fillna(value = my_df['B'].min())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  6.0  9  12